import xlrd
import xlutils
import xlwt
from xlutils import copy
import pandas as pd
import math
import random
#写入excel



#读excel表
book=xlrd.open_workbook('/home/haoge/桌面/500GB/备份/文档/数据分析/实训耗材数据/数据分析excel表/采购入库信息_20191224202718.xls')
new_book=copy.copy(book)
new_sheet=new_book.get_sheet(0)
m=1
d=1
All=pd.read_excel('/home/haoge/桌面/500GB/备份/文档/数据分析/实训耗材数据/数据分析excel表/采购入库信息_20191224202718.xls')
kind=All['单据名称'].unique()




#2018年-2019年第一学期实训耗材(105,427)#1~100,1~100
# 2018-2019下耗材采购计划(555,728)#200~300,200~400
# QC2018-2019（下）学期实训耗材采购清单(802,915) # 400~500,100~200
# YS2018-2019（二）学期实训耗材（1）(919,1025)#1~200 ,300~500
# SXY2018-2019下学期耗材明细(1099,1217)#300~400,800~900
# 2018-2019年第2学期HH实训耗材(1393,1517)#150~300,600~800
# HH2019-2020上学期实训耗材(1710,2056)#200~400,50~90
# SXY2019-2020（上）实训耗材采购清单(2289,2410)#1000~1500,600~900
# 2019-2020（1）DZ耗材采购(2499,2651)#1000~1300 ,100~200
# 2019年DZ电子设计大赛(2652,3040)#1500~1750,300~500
# 2019-2020上学期耗材(3089,3190)#300~400,50~150

a=[105,555,802,919,1099,1393,1710,2289,2499,2652,3089]
b=[427,728,915,1025,1217,1517,2056,2410,2651,3040,3190]
def hs(a,b,c,d,e,f):
    for i in range(a,b):
        a=random.randint(c,d)
        b=random.randint(e,f)
        g=a*b
        new_sheet.write(i,13,'{}'.format(a))
        new_sheet.write(i, 14, '{}'.format(b))
        new_sheet.write(i, 15, '{}'.format(g))

hs(105,427,1,100,1,100)
hs(555,728,200,300,200,400)
hs(802,915,400,500,100,200)
hs(919,1025,1,200,300,500)
hs(1099,1217,300,400,800,900)
hs(1393,1517,150,300,600,800)
hs(1710,2056,200,400,50,90)
hs(2289,2410,1000,1500,600,900)
hs(2499,2651,1000,1300,100,200)
hs(2652,3040,1500,1750,300,500)
hs(3089,3190,1500,300,400,50,150)



















new_book.save('./线性回归方程信息图.xls')